<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"azurerm","backend":"41c36a8bb2f5711c1ccba7c679f7b871490f970729f413ea633a8f1e19b98309","plan_job_ref":"Job Create Terraform plan (DEV) #167 at https://github.com/AudioProthese/openmrs-core-infrastructure/actions/runs/15197345049","plan_out_hash":"0b1411fd3af2cdc5059753e76be671cb856e830f6a6379c9b05695c4045e233e","plan_hash":"609c3fc1e2b75649c75bf66c9f7f29838c981ce8be8daf9d5c818a2c24dc0e36","plan_text_format":"diff","version":"1.48.0"} -->
Terraform plan in __terraform/dev/__
<details>
<summary>Plan: 2 to add, 1 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_kubernetes_cluster.aks will be updated in-place
!~  resource "azurerm_kubernetes_cluster" "aks" {
        id                                  = "/subscriptions/c2b90606-cc96-463f-aa06-70f32719fe4f/resourceGroups/rg-openmrscore-dev/providers/Microsoft.ContainerService/managedClusters/openmrs-dev-audioprothese-aks"
        name                                = "openmrs-dev-audioprothese-aks"
        tags                                = {
            "Environment"  = "dev"
            "organization" = "audioprothese"
            "project"      = "openmrs"
        }
#        (31 unchanged attributes hidden)

!~      default_node_pool {
            name                          = "default"
            tags                          = {}
#            (30 unchanged attributes hidden)

-           upgrade_settings {
-               drain_timeout_in_minutes      = 0 -> null
-               max_surge                     = "10%" -> null
-               node_soak_duration_in_minutes = 0 -> null
            }
        }

#        (4 unchanged blocks hidden)
    }

  # azurerm_role_assignment.user_keyvault_secret_access will be created
+   resource "azurerm_role_assignment" "user_keyvault_secret_access" {
+       condition_version                = (known after apply)
+       id                               = (known after apply)
+       name                             = (known after apply)
+       principal_id                     = "************************************"
+       principal_type                   = "User"
+       role_definition_id               = (known after apply)
+       role_definition_name             = "Key Vault Secrets User"
+       scope                            = "/subscriptions/c2b90606-cc96-463f-aa06-70f32719fe4f/resourceGroups/rg-openmrscore-dev/providers/Microsoft.KeyVault/vaults/openmrs-dev-vault"
+       skip_service_principal_aad_check = true
    }

  # helm_release.oauth2_proxy is tainted, so must be replaced
-/+ resource "helm_release" "oauth2_proxy" {
!~      id                         = "************" -> (known after apply)
+       manifest                   = (known after apply)
!~      metadata                   = [
-           {
-               app_version    = "7.9.0"
-               chart          = "oauth2-proxy"
-               first_deployed = 1747949289
-               last_deployed  = 1747949289
-               name           = "oauth2-proxy"
-               namespace      = "authgate"
-               notes          = <<-EOT
                    To verify that oauth2-proxy has started, run:
                    
                      kubectl --namespace=authgate get pods -l "app=oauth2-proxy"
                    
                    CHART NAME: redis
                    CHART VERSION: 21.0.0
                    APP VERSION: 8.0.0
                    
                    Did you know there are enterprise versions of the Bitnami catalog? For enhanced secure software supply chain features, unlimited pulls from Docker, LTS support, or application customization, see Bitnami Premium or Tanzu Application Catalog. See https://www.arrow.com/globalecs/na/vendors/bitnami for more information.
                    
                    ** Please be patient while the chart is being deployed **
                    
                    Redis&reg; can be accessed on the following DNS names from within your cluster:
                    
                        oauth2-proxy-redis-master.authgate.svc.cluster.local for read/write operations (port 6379)
                        oauth2-proxy-redis-replicas.authgate.svc.cluster.local for read-only operations (port 6379)
                    
                    
                    
                    To get your password run:
                    
                        export REDIS_PASSWORD=$(kubectl get secret --namespace authgate oauth2-proxy-redis -o jsonpath="{.data.redis-password}" | base64 -d)
                    
                    To connect to your Redis&reg; server:
                    
                    1. Run a Redis&reg; pod that you can use as a client:
                    
                       kubectl run --namespace authgate redis-client --restart='Never'  --env REDIS_PASSWORD=$REDIS_PASSWORD  --image docker.io/bitnami/redis:8.0.0-debian-12-r0 --command -- sleep infinity
                    
                       Use the following command to attach to the pod:
                    
                       kubectl exec --tty -i redis-client \
                       --namespace authgate -- bash
                    
                    2. Connect using the Redis&reg; CLI:
                       REDISCLI_AUTH="$REDIS_PASSWORD" redis-cli -h oauth2-proxy-redis-master
                       REDISCLI_AUTH="$REDIS_PASSWORD" redis-cli -h oauth2-proxy-redis-replicas
                    
                    To connect to your database from outside the cluster execute the following commands:
                    
                        kubectl port-forward --namespace authgate svc/oauth2-proxy-redis-master 6379:6379 &
                        REDISCLI_AUTH="$REDIS_PASSWORD" redis-cli -h 127.0.0.1 -p 6379
                    
                    WARNING: There are "resources" sections in the chart not set. Using "resourcesPreset" is not recommended for production. For production installations, please set the following values according to your workload needs:
                      - replica.resources
                      - master.resources
                    +info https://kubernetes.io/docs/concepts/configuration/manage-resources-containers/
                EOT
-               revision       = 1
-               values         = jsonencode(
                    {
-                       config             = {
-                           existingSecret = "oauth2-proxy-secret"
                        }
-                       extraArgs          = [
-                           "--provider=oidc",
-                           "--oidc-issuer-url=https://login.microsoftonline.com/8a25df97-9f2b-4ef1-a9e7-3faf585640e8/v2.0",
-                           "--scope=openid email profile",
-                           "--email-domain=*",
-                           "--redirect-url=https://oauth2.dev.audioprothese.ovh/oauth2/callback",
-                           "--skip-provider-button",
-                           "--reverse-proxy",
-                           "--cookie-secure=true",
-                           "--cookie-domain=.audioprothese.ovh",
-                           "--cookie-name=_oauth2_proxy",
-                           "--cookie-refresh=2m",
-                           "--cookie-expire=24h",
-                           "--whitelist-domain=.audioprothese.ovh",
-                           "--set-authorization-header=false",
-                           "--pass-access-token=false",
-                           "--pass-user-headers=true",
-                           "--set-xauthrequest=true",
-                           "--oidc-email-claim=preferred_username",
                        ]
-                       ingress            = {
-                           annotations = {
-                               "cert-manager.io/cluster-issuer"                 = "letsencrypt-prod"
-                               "nginx.ingress.kubernetes.io/force-ssl-redirect" = "true"
                            }
-                           className   = "webapprouting.kubernetes.azure.com"
-                           enabled     = true
-                           hosts       = [
-                               "oauth2.dev.audioprothese.ovh",
                            ]
-                           path        = "/oauth2"
-                           pathType    = "Prefix"
-                           tls         = [
-                               {
-                                   hosts      = [
-                                       "oauth2.dev.audioprothese.ovh",
                                    ]
-                                   secretName = "oauth2-tls"
                                },
                            ]
                        }
-                       initContainers     = {
-                           waitForRedis = {
-                               enabled = false
                            }
                        }
-                       proxyVarsAsSecrets = true
-                       redis              = {
-                           enabled = true
                        }
-                       service            = {
-                           portNumber = 4180
-                           type       = "ClusterIP"
                        }
-                       sessionStorage     = {
-                           redis = {
-                               clientType = "standalone"
-                               standalone = {
-                                   connectionUrl = "redis://oauth2-proxy-redis-master:6379/0"
                                }
                            }
-                           type  = "redis"
                        }
                    }
                )
-               version        = "7.12.13"
            },
        ] -> (known after apply)
        name                       = "oauth2-proxy"
!~      status                     = "failed" -> "deployed"
#        (26 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Create Terraform plan (DEV) #167](https://github.com/AudioProthese/openmrs-core-infrastructure/actions/runs/15197345049)